[
{"content":{"body":"dreamdust: (\"we talk about it and decide to add tags\" without any prior research would be much more arbitrary, but hopefully that didn't happen very often)","msgtype":"m.text"},"ts":1379721709000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"Well, like what the purpose of tags serve in HTML? Is there any consensus on that? I'm not saying I disagree with the process just trying to understand the reasoning behind it. To me, the fact that a bunch of people add a \"article\" class to things doesn't mean a tag should be made for it.","msgtype":"m.text"},"ts":1379721841000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"The purpose of tags is to communicate meaning between the page authors and machines reading the page, and to organize the page in a meaningful way so it's easy to edit and maintain.","msgtype":"m.text"},"ts":1379722091000,"senderName":"TabAtkins","senderId":"TabAtkins@irc"},
{"content":{"body":"And incidentally to provide convenient hooks to hang certain types of styles off of.","msgtype":"m.text"},"ts":1379722111000,"senderName":"TabAtkins","senderId":"TabAtkins@irc"},
{"content":{"body":"dreamdust: If I remember correctly (I probably don't), the main thoughts were that a document's elements should semantically describe the document's structure in a way that is meaningful to humans who are writing HTML (and semantics is a good thing and is what HTML has always been about); and that the set of elements should be designed so tools could automatically generate outlines and tables of contents","msgtype":"m.text"},"ts":1379722112000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"Like the header tag for example… what's the point? It doesn't enable me to accomplish anything I could accomplish before. There's no rules on what goes inside it, as browsers render everything inside it. There can be multiple header tags… I mean I can't even read the spec and determine how to use it properly.","msgtype":"m.text"},"ts":1379722116000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"dreamdust: If the examples don't help you use it correctly, file bugs please.","msgtype":"m.text"},"ts":1379722135000,"senderName":"TabAtkins","senderId":"TabAtkins@irc"},
{"content":{"body":"But yes, all the sectioning elements are like you describe.  They're lightly-flavored <div>s.","msgtype":"m.text"},"ts":1379722150000,"senderName":"TabAtkins","senderId":"TabAtkins@irc"},
{"content":{"body":"lightly-flavored!? they seem completely pointless","msgtype":"m.text"},"ts":1379722173000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"In the end I think it comes down to the personal taste of the people who were defining HTML5 at that time","msgtype":"m.text"},"ts":1379722254000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"yeah seriously","msgtype":"m.text"},"ts":1379722268000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"since there are arguments for many possible directions, and that one was chosen","msgtype":"m.text"},"ts":1379722271000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"but not the case with all tags, there is no ambiguity about what a <a> tag is and means and does. Same with something like <li> or <p>. <section>, <header>, <nav> seem so loosely defined I just don't see what we gain from having them.","msgtype":"m.text"},"ts":1379722280000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"and it wasn't a particularly problematic direction for anyone, so it was never worth changing again","msgtype":"m.text"},"ts":1379722306000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"and then the more technical features of HTML5 became very popular, so it took off, and the bits that nobody really cares about (like semantic elements) got dragged along with the rest","msgtype":"m.text"},"ts":1379722372000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"dreamdust: About your original question: I don't think any of the history is documented anywhere, except in the spec's commit log and the WHATWG mailing list and the HTML WG list and the IRC logs","msgtype":"m.text"},"ts":1379722480000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"(i.e. there's a huge amount of documentation and the problem is filtering it)","msgtype":"m.text"},"ts":1379722498000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"Yeah… I'm finding that out now. It's very problematic because there's no way to track the history of a change. Why the header tag is added is essentially lost to time and left for people to deconstruct from searching through hundreds of emails. I suggest moving the spec to github, using a branching model, and having the official spec live there in a master branch. I see it's been put on github but there's no point for anyone to use it because t","msgtype":"m.text"},"ts":1379722840000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"The spec is version-controlled, though not by git.  I'm not sure how switching to git would help this particular issue.","msgtype":"m.text"},"ts":1379722883000,"senderName":"TabAtkins","senderId":"TabAtkins@irc"},
{"content":{"body":"I think the fundamental difficulty is that an enormous amount of thought and discussion goes into each change","msgtype":"m.text"},"ts":1379723163000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"and it would take a large amount of effort to summarise it into an easy-to-read form, so nobody does that","msgtype":"m.text"},"ts":1379723190000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"github not so much git… because of the public link between discussion and spec changes. Requests for changes are formalized with pull requests, and discussion is more linked to the actual git changes.","msgtype":"m.text"},"ts":1379723191000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"Spec discussion happens on email and/or bugzilla bugs.  Moving the discussion forum won't make things any easier, and it would disrupt the existing workflow substantially.","msgtype":"m.text"},"ts":1379723239000,"senderName":"TabAtkins","senderId":"TabAtkins@irc"},
{"content":{"body":"fair enough","msgtype":"m.text"},"ts":1379723255000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"Spec changes should usually be motivated by someone expressing a problem that they would like to be solved, and then people analyse various possible solutions, and might end up with a solution that involves a change to the HTML spec","msgtype":"m.text"},"ts":1379723302000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"right… so how would I go about finding what problem the header tag solved?","msgtype":"m.text"},"ts":1379723319000,"senderName":"dreamdust","senderId":"dreamdust@irc"},
{"content":{"body":"Pull requests seem like the opposite model, since they start with someone proposing a change to the spec","msgtype":"m.text"},"ts":1379723322000,"senderName":"Philip`","senderId":"Philip`@irc"},
{"content":{"body":"iirc, <header> had some XHTML2 baggage","msgtype":"m.text"},"ts":1379723983000,"senderName":"a-ja","senderId":"a-ja@irc"},
{"content":{"body":"TabAtkins, Philip`: in case dreamdust comes back (or anyone else asks), there's also http://wiki.whatwg.org/wiki/Rationale","msgtype":"m.text"},"ts":1379734746000,"senderName":"Hixie_","senderId":"Hixie_@irc"}
]