[
{"content":{"body":"innovati: you know about https://whatwg.org/faq#adding-new-features, right?","msgtype":"m.text"},"ts":1562468759000,"senderName":"MikeSmith","senderId":"MikeSmith@irc"},
{"content":{"body":"especially step #1","msgtype":"m.text"},"ts":1562468777000,"senderName":"MikeSmith","senderId":"MikeSmith@irc"},
{"content":{"body":"> Forget about the particular solution you have in mind! Solution time is later!","msgtype":"m.text"},"ts":1562468783000,"senderName":"MikeSmith","senderId":"MikeSmith@irc"},
{"content":{"body":"so the process is basically to not propose new global attributes at all, ever","msgtype":"m.text"},"ts":1562468832000,"senderName":"MikeSmith","senderId":"MikeSmith@irc"},
{"content":{"body":"but instead, explain what problem you want solved","msgtype":"m.text"},"ts":1562468863000,"senderName":"MikeSmith","senderId":"MikeSmith@irc"},
{"content":{"body":"and then in that context note that you think a new global attribute might be a solution the problem, and why","msgtype":"m.text"},"ts":1562468947000,"senderName":"MikeSmith","senderId":"MikeSmith@irc"},
{"content":{"body":"MikeSmith Expressing what I know doesn't really give me any new information. I can write something up, but I still wouldn't know if I'm completely wasting 100% of my time","msgtype":"m.text"},"ts":1562511301000,"senderName":"innovati","senderId":"innovati@irc"},
{"content":{"body":"I'm not trying to propose a feature today, I'm wondering about the feasibility of global attributes possibly happening if a good solution was found. If it's not feasible ever I would try to explore something that was more feasible instead","msgtype":"m.text"},"ts":1562511455000,"senderName":"innovati","senderId":"innovati@irc"},
{"content":{"body":"I was really hoping for some insight about global attributes and what it takes for one to be accepted, I believe each global attribute that can exist carries a small performance hit when creating new elements? If that's true you'd think they would aim to keep the list as short as possible for reasons. Those kinds of reasons and considerations around what global attributes cost and mean are what I'm hoping to learn","msgtype":"m.text"},"ts":1562511584000,"senderName":"innovati","senderId":"innovati@irc"},
{"content":{"body":"I'm helping to explore ways that things like ResizeObserver, MutationObserver, and IntersectionObserver might be utilized and controlled from CSS in a standard way, and part of that will need to be a way to target matching elements with selectors.","msgtype":"m.text"},"ts":1562512015000,"senderName":"innovati","senderId":"innovati@irc"},
{"content":{"body":"There are ways to wrote something like that which are valid CSS but incredibly unlikely to ever get standardized, and there are ways you could express it that are a much smaller ask and stand a better chance actually maybe becoming something","msgtype":"m.text"},"ts":1562512073000,"senderName":"innovati","senderId":"innovati@irc"},
{"content":{"body":"I'd like to try my best to stick as close to reality as possible :D","msgtype":"m.text"},"ts":1562512184000,"senderName":"innovati","senderId":"innovati@irc"}
]