[
{"content":{"body":"i've always liked to download the HTML specification for offline usage (since the 1990s) and after W3C replied on Github and finally made an html52.tar.gz file, they said they'd do one for future versions... but I don't see an html53.tar.gz anywhere, or is that not the latest normally-numbered version?","msgtype":"m.text"},"ts":1577095908000,"senderName":"DarwinElf","senderId":"DarwinElf@irc"},
{"content":{"body":"hmm... it's a living document now?  Anytime I edit HTML and might have to learn/review something, is it best to just read/download the latest version?  It used to sometimes be years until I was aware of a new version from W3C but it seems you're working on it much more than they were in the past...","msgtype":"m.text"},"ts":1577096802000,"senderName":"DarwinElf","senderId":"DarwinElf@irc"},
{"content":{"body":"though it'd be nice to read from a tarball as well as single-page or PDF... is it acceptable/doable to copy the developer version with wget or something?","msgtype":"m.text"},"ts":1577096906000,"senderName":"DarwinElf","senderId":"DarwinElf@irc"},
{"content":{"body":"DarwinElf: that should be fine, there’s also a PDF","msgtype":"m.text"},"ts":1577100743000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"DarwinElf: there’s a half-yearly snapshot for lawyers, but for most people the latest version is the one to read, which is updated somewhat frequently indeed","msgtype":"m.text"},"ts":1577100844000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"annevk: What would an async/defer equivalent for images buy us? They are already not render-blocking. It could unblock the load event but is that a big win?","msgtype":"m.text"},"ts":1577113812000,"senderName":"domfarolino","senderId":"domfarolino@irc"},
{"content":{"body":"domfarolino: it might be as lots of execution blocks on that; pages coded that way might not adopt this though","msgtype":"m.text"},"ts":1577115496000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"domfarolino: I think it also frees up some space for browsers to innovate versus only fetching when it is about to intersect the viewport","msgtype":"m.text"},"ts":1577119627000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"waves","msgtype":"m.emote"},"ts":1577119961000,"senderName":"Ms2ger","senderId":"Ms2ger@irc"},
{"content":{"body":"See y'all in '20","msgtype":"m.text"},"ts":1577119967000,"senderName":"Ms2ger","senderId":"Ms2ger@irc"},
{"content":{"body":"annevk: Sounds like that would result in a looser spec than we have now right? We'd specify the image can be deferred from parse-time until basically any time the browser wants to fetch...that seems vague","msgtype":"m.text"},"ts":1577120436000,"senderName":"domfarolino","senderId":"domfarolino@irc"},
{"content":{"body":"domfarolino: yeah","msgtype":"m.text"},"ts":1577120921000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"annevk: seems a little tricky to test, but haven’t thought about it much","msgtype":"m.text"},"ts":1577121143000,"senderName":"domfarolino","senderId":"domfarolino@irc"},
{"content":{"body":"Got a question re: https://gist.github.com/alice/174ae481dacdae9c934e3ecb2f752ccb","msgtype":"m.text"},"ts":1577134169000,"senderName":"bathos","senderId":"bathos@irc"},
{"content":{"body":"I was under the (maybe mistaken) impression that one of the motivations for the AOM reflection API was that it could solve currently intractable accessibility issues when using shadow DOM. One of the options listed in this gist says that it ‘does not allow authors to refer to elements across any shadow boundaries.’ Am I understanding correctly that this means this API might not end up addressing those issues?","msgtype":"m.text"},"ts":1577134185000,"senderName":"bathos","senderId":"bathos@irc"},
{"content":{"body":"bathos: yes, my understanding is that due to Apple and Mozilla preferences it is no longer clear whether we will be able to have accessible shadow DOM structures in this way.","msgtype":"m.text"},"ts":1577134879000,"senderName":"Domenic","senderId":"Domenic@irc"},
{"content":{"body":"ouch ... well, crossing my fingers that they’ll reconsider its importance. thanks for confirming","msgtype":"m.text"},"ts":1577134982000,"senderName":"bathos","senderId":"bathos@irc"}
]