[
{"content":{"body":"thanks.  If development has sped up then (I can just save it with note of the date maybe rather than commit hash) I'll just view or maybe copy the site if I'm going to be reading it a lot.  The half-yearly archive for lawyers doesn't sound as useful as the development version...","msgtype":"m.text"},"ts":1577152586000,"senderName":"DarwinElf","senderId":"DarwinElf@irc"},
{"content":{"body":"bathos: https://annevankesteren.nl/2019/10/encapsulation-theory","msgtype":"m.text"},"ts":1577173424000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"bathos: that shouldn’t really prevent anything per se btw, but would require a different approach to the design","msgtype":"m.text"},"ts":1577173512000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"thanks, annevk. I’m very interested in the subject of hard privacy in custom elements, but I think I’ve misunderstood something because I don’t see how the refs would break it.","msgtype":"m.text"},"ts":1577173517000,"senderName":"bathos","senderId":"bathos@irc"},
{"content":{"body":"bathos: if the refs are on a light tree node you have a public API pointing into the shadow tree","msgtype":"m.text"},"ts":1577173618000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"I was like ??? at first because the refs would seem to need to have been explicitly exposed to that end, which is always possible, but I think I understand what you’re saying now — are you talking about cases where the relationship desired is one where the a shadow-enclosed element is the referencee rather than the referencer?","msgtype":"m.text"},"ts":1577173752000,"senderName":"bathos","senderId":"bathos@irc"},
{"content":{"body":"I’ve never run into the need for that so I hadn’t considered it, but it makes sense that it would happen sometimes. (I hit the opposite issue pretty much daily.)","msgtype":"m.text"},"ts":1577173795000,"senderName":"bathos","senderId":"bathos@irc"},
{"content":{"body":"in any case though I have no investment in a particular solution and I’m glad it sounds like it’s a design question rather than just dropping the issue","msgtype":"m.text"},"ts":1577173830000,"senderName":"bathos","senderId":"bathos@irc"},
{"content":{"body":"bathos: shadow referencing light tree is fine btw and doesn’t break encapsulation","msgtype":"m.text"},"ts":1577176993000,"senderName":"annevk","senderId":"annevk@irc"},
{"content":{"body":"yep, that’s what I was missing — I was only considering that scenario","msgtype":"m.text"},"ts":1577177033000,"senderName":"bathos","senderId":"bathos@irc"}
]