[
{"content":{"body":"hey all! I just wanted to give a quick update about decorators, Test262, and the possibilty of moving back to stage 2.7","m.mentions":{},"msgtype":"m.text"},"ts":1710945427325,"senderName":"pzuraq","senderId":"@pzura:matrix.org","id":"$daJnKwMp8eJTbYbiz3Xx_3-__3rI7CqgnOq7xMLx-GE"},
{"content":{"body":"Where we're at: Decorators currently do not have tests in Test262, and there have been some inconsistencies between implementations due to this. The new stage 2.7 in the TC39 process is meant to address these types of issues by requiring tests to exist _before_ advancing to stage 3.\n\nBecause of these issues, there has been some discussion of moving decorators back from stage 3 to stage 2.7, even though this stage was added after decorators advanced. I understand the reasoning behind this and support the decision if the committee does decide to do this, but given the fraught history of decorators I think this would be really bad for _optics_ in the larger community. So, I've been trying to get tests written before the next plenary to prevent this from happening.\n\nUnfortunately, my personal life has made this difficult 🙃","format":"org.matrix.custom.html","formatted_body":"<p>Where we're at: Decorators currently do not have tests in Test262, and there have been some inconsistencies between implementations due to this. The new stage 2.7 in the TC39 process is meant to address these types of issues by requiring tests to exist <em>before</em> advancing to stage 3.</p>\n<p>Because of these issues, there has been some discussion of moving decorators back from stage 3 to stage 2.7, even though this stage was added after decorators advanced. I understand the reasoning behind this and support the decision if the committee does decide to do this, but given the fraught history of decorators I think this would be really bad for <em>optics</em> in the larger community. So, I've been trying to get tests written before the next plenary to prevent this from happening.</p>\n<p>Unfortunately, my personal life has made this difficult 🙃</p>\n","m.mentions":{},"msgtype":"m.text"},"ts":1710945442360,"senderName":"pzuraq","senderId":"@pzura:matrix.org","id":"$ziXqKrHpqeoTZPHsJoMMAEF110w7PBzWoPDfplCgu60"},
{"content":{"body":"TL; DR: My partner and I started a DIY home renovation project over Christmas and our house has been chaos since then (kitchen unusable, eating out all the time, rooms disorganized, etc). Then, in January, my job situation changed and I had to start figuring out what I would be doing next, and that delayed finishing the project. Between those two things, I've had basically 0 cycles to put toward writing tests.\n\nI finally do have clarity on my job situation and am effectively between jobs at the moment, so I'm now back at full steam getting my house together. As soon as that's at a stopping point, my plan is to work on the tests. We still have 2.5 weeks until the plenary, and I expect to have time to work on the tests next week, so I do think I will be able to get a draft PR that is mostly complete up by the plenary.","m.mentions":{},"msgtype":"m.text"},"ts":1710945480188,"senderName":"pzuraq","senderId":"@pzura:matrix.org","id":"$ppnogBglJwEdJo8h5olvfYMamvk39huIhka0WBCYV3M"},
{"content":{"body":"That said, if anyone has some spare cycles to help it would definitely be appreciated! Even getting some basic drafts of tests done this week so I can jump in and polish them next week would be really helpful 😄","m.mentions":{},"msgtype":"m.text"},"ts":1710945495377,"senderName":"pzuraq","senderId":"@pzura:matrix.org","id":"$9CRW8UQx3JLFbYsbAI--XI6MUKXjGoq7dliRzOUClxU"},
{"content":{"body":"Also, I'm considering opening up an issue about this on the proposal to see if any other maintainers out there can help out, but I don't want to spread too much FUD about decorators moving back at the same time. Anyone have thoughts about that?","m.mentions":{},"msgtype":"m.text"},"ts":1710945696940,"senderName":"pzuraq","senderId":"@pzura:matrix.org","id":"$P9BGnXNJq9Hum57OEroP5irZ9x_EaESqeHPrlWOehRw"}
]