[
{"content":{"body":"Does there exist stated design rationale for why `Intl.Collator` (which, unlike many other APIs, doesn't format anything) falls back to the host locale instead of falling back to `und`? Considering that the root collation is more likely to be valid for a language that isn't explicitly listed in CLDR than a non-root host-language collation, the specified behavior seems unfortunate. Moreover, it's bad that the distinction isn't visible in the typical CI locale of en-US.","format":"org.matrix.custom.html","formatted_body":"Does there exist stated design rationale for why <code>Intl.Collator</code> (which, unlike many other APIs, doesn't format anything) falls back to the host locale instead of falling back to <code>und</code>? Considering that the root collation is more likely to be valid for a language that isn't explicitly listed in CLDR than a non-root host-language collation, the specified behavior seems unfortunate. Moreover, it's bad that the distinction isn't visible in the typical CI locale of en-US.","msgtype":"m.text"},"ts":1692264973712,"senderName":"hsivonen","senderId":"@hsivonen:mozilla.org","id":"$kSPWWBSCrlNe0SqIMvSHX2FojcBld5OhVe7r5dGBPXA"},
{"content":{"body":"Everything in Intl falls back to the host locale… I think that’s the extent of the rationale.","msgtype":"m.text"},"ts":1692275804103,"senderName":"littledan","senderId":"@littledan:matrix.org","id":"$7gZ7fCYvqiYa_s_ki72dDp_kGkYCb1do2Wiv0wso_Vo"},
{"content":{"body":"If we wanted to work on Intl.Collator, we should probably address the thing where the design forces a bunch of recalculation of the collation key to do any sorting…","msgtype":"m.text"},"ts":1692275876327,"senderName":"littledan","senderId":"@littledan:matrix.org","id":"$1TCCMQhCM-8c6eVFzc7u18QcUsbBJVjsp98TtOesAS0"},
{"content":{"body":"> Moreover, it's bad that the distinction isn't visible in the typical CI locale of en-US.\nCan you check the resolved options to get the locale?","msgtype":"m.text"},"ts":1692283180816,"senderName":"sffc","senderId":"@sffc:mozilla.org","id":"$JIcKvcMtYv_Z6TptznvRaJtS1gHthn-eLRpR8xMKB6A"}
]