[
{"content":{"body":"Hello! I would like to bring to the attention of people working on HTML5 team the issue of working with footnotes and also the issue of a 1.5 column layout (with footnotes as sidenotes/marginnotes).   I am convinced that it should be possible to write in Tufte Style (https://edwardtufte.github.io/tufte-css/) seamlessly using clean, semantic HTML5 only, without any JS whatsoever. \n\nFor this purpose, it should be easily possible to have a 1.5 column layout. Furthermore, critically, footnotes as sidenotes should be easy to place in the margin at the appropriate height in the margin even in crowded margin situations (not flowing over other footnotes but elegantly positioned as close to the definition position as possible without any overlaps).\nSecond, there should be an easy way to number footnotes with two different numbering schemes, ie. arabic for sources and alphabetical (from [a] to [zzzzz] for notes). It should be also possible to add a note without any numbering (marginnote) in the margin space.\n\nPlease, please, please. Seamless support for footnotes in 1.5 column layout is absolutely essential for my use of semantic, clean HTML5. This is because footnotes are absolutely critical (I am not convinced by tooltips as they require an additional click and are not readily visible) and it's a design flaw to place them at the very, very end.\n\nIs there any hope that somebody will look into it?","msgtype":"m.text"},"ts":1639737843971,"senderName":"m4themagic","senderId":"@m4themagic:matrix.org","id":"$FdCHduR2yUt5DI2eHe1XC9uROLFd21Fjw2WSds5MlSA"},
{"content":{"body":"m4themagic: could you explain how this pertains to HTML and not CSS? ","format":"org.matrix.custom.html","formatted_body":"<a href=\"https://matrix.to/#/@m4themagic:matrix.org\">m4themagic</a>: could you explain how this pertains to HTML and not CSS?","msgtype":"m.text"},"ts":1639738620811,"senderName":"annevk","senderId":"@annevk:mozilla.org","id":"$oeZLBXpuiJGaaR9u6saszG8E3PI1aiGNoDbxa8nd1BA"},
{"content":{"body":"Good point. I didn't consider this. Nonetheless, it seems to be a good design goal to make 1.5 column layout implementable in HTML5+CSS as easily, as cleanly and as semanticly as possible, which may bring some considerations for HTML5 as well. \n\nThe reason for this is that it should not be considered as some custom and unnatural layout but an essential one. Almost as important as the one with footnotes at the end (1-column). In this way, I would be able to ditch Latex in favor of clean HTML5. Currently, I need Latex to make footnotes adjust well and automatically. I would like to treat HTML5+CSS pages in 1.5-column layout as primary way of storing science-related or any other quality articles with footnotes. But I don't want to store them in a highly convoluted way that will make them inaccessible in 10 years' time. I would like to use a method almost as reliable as pdf but plain-text.\n\nThis could also have some implications for EPUB files.","msgtype":"m.text"},"ts":1639740291853,"senderName":"m4themagic","senderId":"@m4themagic:matrix.org","id":"$kaFMZHAfk-4GanpKyfhlVBHKC40wlkeZBzW2G62YRjA"},
{"content":{"body":"annevk: ^","format":"org.matrix.custom.html","formatted_body":"<a href=\"https://matrix.to/#/@annevk:mozilla.org\">annevk</a>: ^","msgtype":"m.text"},"ts":1639740304770,"senderName":"m4themagic","senderId":"@m4themagic:matrix.org","id":"$nCpET9M1tK4Lqrq4wTBNSvBlPQ0YAx35eWcDDZp-Xgc"},
{"content":{"body":"EPUB is just packaged HTML and CSS so I somewhat doubt that. Anyway, I recommend taking this to the CSS WG. And probably search their issue archive first as this is likely something that has come up before.","msgtype":"m.text"},"ts":1639740409886,"senderName":"annevk","senderId":"@annevk:mozilla.org","id":"$v9nKbGQnSeaBT43J79l0lXSnVPfumMmtjOVXCsUBTLI"},
{"content":{"body":"Thank you, I plan to do so.","msgtype":"m.text"},"ts":1639740685811,"senderName":"m4themagic","senderId":"@m4themagic:matrix.org","id":"$lUzbjQ84QSy7IRE2k6SYwb8lau7oPiilmhHFHDZxt_4"},
{"content":{"body":"As a side note, it seems that there are many semantic elements in HTML for articles: article, section, header, footer AND **aside** which prima facie sounds excellent for 1.5 column layout but I guess there are difficulties with making it work properly and automatically in a 1.5 column layout. From the spec:\n\n\"The aside element represents a section of a page that consists of content that is tangentially related to the content around the aside element, and which could be considered separate from that content. Such sections are often represented as sidebars in printed typography.\"","format":"org.matrix.custom.html","formatted_body":"<p>As a side note, it seems that there are many semantic elements in HTML for articles: article, section, header, footer AND <strong>aside</strong> which prima facie sounds excellent for 1.5 column layout but I guess there are difficulties with making it work properly and automatically in a 1.5 column layout. From the spec:</p>\n<p>&quot;The aside element represents a section of a page that consists of content that is tangentially related to the content around the aside element, and which could be considered separate from that content. Such sections are often represented as sidebars in printed typography.&quot;</p>\n","msgtype":"m.text"},"ts":1639741996461,"senderName":"m4themagic","senderId":"@m4themagic:matrix.org","id":"$SLu_ItgM96oJGEBrEiVIepCSBL5HYkliEbpLMFY0qlo"},
{"content":{"body":"One idea (perhaps bad), would be to extend HTML with \"margin\" in addition to header and footer elements. Margin notes are very important, essential. Proof of Fermat's theorem is famous for being first mentioned on a margin. I understand that web is not print but this positioning with readily visible notes or footnotes makes sense also for web.","msgtype":"m.text"},"ts":1639742671099,"senderName":"m4themagic","senderId":"@m4themagic:matrix.org","id":"$JiQfiQI6eyXAGaqadiN1cziQ2ZE40x3Ic0yZmKFfVWM"},
{"content":{"body":"The distinguishing trait of margin notes is that their vertical positioning is universally related to the position of the text they comment on.","msgtype":"m.text"},"ts":1639742827628,"senderName":"m4themagic","senderId":"@m4themagic:matrix.org","id":"$bv8L9WtlNA-TA4lniSAo7dLnQai4gfJbeA7fsV0soK4"},
{"content":{"body":"I'm no expert, but the `<aside>` element seems fit for margin notes, even if its default style doesn't do anything special","format":"org.matrix.custom.html","formatted_body":"I'm no expert, but the <code>&lt;aside&gt;</code> element seems fit for margin notes, even if its default style doesn't do anything special","msgtype":"m.text"},"ts":1639742886667,"senderName":"Andreu Botella (he/they)","senderId":"@andreubotella:mozilla.org","id":"$Akoxz6SLaOD8x8ZzL-EqO9N9OqywaTEpNsn-O4Fsm7A"}
]