[
{"content":{"body":"> <@tabatkins:matrix.org> Because I prefer Bikeshed being robust to failure as much as possible, so you can run with `-f` and still get something reasonable rather than forcing people to have a fully working build. (That is, the messages are intended to be lint-level as much as possible; it's of course reasonable to require zero linting errors to publish/update.) That implies I want visibility into the build result regardless. It is just *also* the case, again, that I should be capturing the messages so I know when I'm throwing more or different errors than I previously did. Like I said, this is going to be fixed.\n\nBut again, this is about WHATWG specs. THey *don't* prefer to be robust to failure; they prefer to fail-fast (like your new HTML parser). We're asking that you reflect that in your test suite, so your test suite gets the same failures as the actual live environment.","format":"org.matrix.custom.html","formatted_body":"<mx-reply><blockquote><a href=\"https://matrix.to/#/!AGetWbsMpFPdSgUrbs:matrix.org/$oB8QokMJnbYmZCoY4aUK9rAGD3w83I9XSHrY9H051I8?via=matrix.org&via=mozilla.org&via=igalia.com\">In reply to</a> <a href=\"https://matrix.to/#/@tabatkins:matrix.org\">@tabatkins:matrix.org</a><br>Because I prefer Bikeshed being robust to failure as much as possible, so you can run with <code>-f</code> and still get something reasonable rather than forcing people to have a fully working build. (That is, the messages are intended to be lint-level as much as possible; it's of course reasonable to require zero linting errors to publish/update.) That implies I want visibility into the build result regardless. It is just <em>also</em> the case, again, that I should be capturing the messages so I know when I'm throwing more or different errors than I previously did. Like I said, this is going to be fixed.</blockquote></mx-reply>But again, this is about WHATWG specs. THey <em>don't</em> prefer to be robust to failure; they prefer to fail-fast (like your new HTML parser). We're asking that you reflect that in your test suite, so your test suite gets the same failures as the actual live environment.","m.relates_to":{"m.in_reply_to":{"event_id":"$oB8QokMJnbYmZCoY4aUK9rAGD3w83I9XSHrY9H051I8"}},"msgtype":"m.text"},"ts":1690245122831,"senderName":"Domenic","senderId":"@domenicdenicola:matrix.org","id":"$fU3igoc0H7lqisQkDpfn2NTTcNml_mH4hf_4NR7W-rk"},
{"content":{"body":"Capturing the build messages will accomplish the same thing (any messages at all are bad for whatwg specs) without making me lose output entirely when there's a change in build messages. ","msgtype":"m.text"},"ts":1690245245317,"senderName":"TabAtkins","senderId":"@tabatkins:matrix.org","id":"$Qp7beYekjU5IxIQ-QdXOKXyj3N_Q6_8gzA5CIwaezIM"},
{"content":{"body":"The thing you're actually asking for (ensure that new messages don't break your build) is on my task list this quarter.","msgtype":"m.text"},"ts":1690245286182,"senderName":"TabAtkins","senderId":"@tabatkins:matrix.org","id":"$IbAsbsaZnuFykjZKCQemr7S-6zfRKa4jifVauWXnltQ"},
{"content":{"body":"I just think there's a lot to be said for having tests match prod","msgtype":"m.text"},"ts":1690246184050,"senderName":"Domenic","senderId":"@domenicdenicola:matrix.org","id":"$qe11OKeCaYQwchfCmJrz5xsOvzeSuETnwpkWfLdbYS8"},
{"content":{"body":"Hello. I hope this is my last cross-post. I was pointed to this room to ask my question.","msgtype":"m.text"},"ts":1690294183566,"senderName":"KBar","senderId":"@kbar:mozilla.org","id":"$ZxMN_J913o8AJZ29ozXk8IG31Iy0hR6DGuLf7WGxKW0"},
{"content":{"body":"i should probably raise this to whatwg, but i was wondering why are user agents required to load `about:blank` in quirks mode? is there a specific reason? if not, shouldn't step 2 of [loading an HTML document](https://html.spec.whatwg.org/multipage/document-lifecycle.html#read-html) include something like\n\n> 1. Let _doctype_ be the result of creating a document type with the qualified name of \"html\"\n> …\n> 5 Append _doctype_ to _document_.\n\nor similar steps?","format":"org.matrix.custom.html","formatted_body":"<p>i should probably raise this to whatwg, but i was wondering why are user agents required to load <code>about:blank</code> in quirks mode? is there a specific reason? if not, shouldn't step 2 of <a href=\"https://html.spec.whatwg.org/multipage/document-lifecycle.html#read-html\">loading an HTML document</a> include something like</p>\n<blockquote>\n<ol>\n<li>Let <em>doctype</em> be the result of creating a document type with the qualified name of \"html\"<br>…<br>5 Append <em>doctype</em> to <em>document</em>.</li>\n</ol>\n</blockquote>\n<p>or similar steps?</p>\n","msgtype":"m.text"},"ts":1690294200087,"senderName":"KBar","senderId":"@kbar:mozilla.org","id":"$gTNYA8m6iFxcYIEdG1ZvBLlQiCMooKzrHSax7xbSihw"}
]