[
{"content":{"body":"Normally, we teach kids HTML, CSS and JavaScript, using just NotePad, Notepad++ and a Web browser.\n\nAnd most times, we do this without an internet connection, without having a server, and without having a backend like NodeJS, WAMP, or XAMPP.\n\nThe challenge I have, is that I want to teach these kids the Download Functionality.\n\nBut when we add the \"Download Attribute\" to the href of our Anchor Tag, the file doesn't download.\n\nRather, it opens up in a new Tab or window.\n\nWhat I found out, is that, the \"Download Attribute\" doesn't work on the Local file system.\n\nThis is the same issue here on GitHub---https://github.com/mozilla-mobile/firefox-ios/issues/13299\n\nSince we are moving some things into HTML and CSS according to this talk-- https://youtu.be/IP_rtWEMR0o\n\nIn which case, things like Dialog (modal) are now tags in HTML.\n\nMY REQUEST\nAdd parameters to the \"Download Attribute\" --- where we can specify the source of the downloadable file.\n\nParameters like \"localfile\", \"server\", \"domain\", \"filesystem\".\n\nThese parameters to the Download Attribute, makes it more versatile and capable.\n\n--\"localfile\" -- means that the fie is in the same root as the index.html file.\n\n-- \"server\" -- -- means that the file is hosted on a Web Server. In this case, it will only allow for absolute URL in the href.\n\n--  \"domain\"-- means that the file is hosted on a Web Server of same-origin. In this case, it can allow for relative URL in the href.\n\n-- \"filesystem\"---- means that the file is hosted on a Laptop or Personal Computer(PC).\n\nThis should allow the Download Attribute to still download the file, using relative URL in the href.\n\nTHE CHALLENGE\nI am not able to download from my Local File system, not able to download within my PC with the Download Attribute, and I have raised it on Microsoft Forum -- https://answers.microsoft.com/en-us/microsoftedge/forum/all/html5-download-attribute-is-not-working-at-all-on/6f0681ee-05b6-49f8-a0f2-9ef6b6e27460\n\nAnd also on W3Schools Forum --- https://w3schools.invisionzone.com/topic/63572-html5-download-attribute-is-not-working-at-all-on-all-browsers/\n\nMOVING FORWARD\nIf WHATWG can add parameters as specified, or parameters that they see fit, which can allow us use the Download Attribute to natively download files from the Local File System of my Laptop or PC, I will be the most glad and grateful to WHATWG.\n\nSpecial Regards, as I keenly await your positive response.","m.mentions":{},"msgtype":"m.text"},"ts":1729154787757,"senderName":"gamicord","senderId":"@gamicord:matrix.org","id":"$ZjiPHJZns_ggLWd0W_oA9Mmj6cp6SKTJyM8OkQj12SY"},
{"content":{"body":"Did anyone try to reproduce that by chance? This person also emailed `sg@`. My suspicion is that these are browser bugs and no new feature is needed.","format":"org.matrix.custom.html","formatted_body":"Did anyone try to reproduce that by chance? This person also emailed <code>sg@</code>. My suspicion is that these are browser bugs and no new feature is needed.","m.mentions":{},"msgtype":"m.text"},"ts":1729171092780,"senderName":"annevk","senderId":"@annevk:matrix.org","id":"$_Ojo9cpCZ7YUGtlqY3rkQIEM9F3JCQiUI2Z0nUwI4GQ"},
{"content":{"body":"I am a little surprised that you do not have a web server for your course, containing the course documentation.  Designing web sites is intrinsically a cooperative group activity.  To some extent the whole point of the Web is that it is NOT contained on your own computer.  Why teach your students something they will never use outside of the class?  You do not need connectivity to the outside world, just a WiFi node that all of the student's devices are connected to that also includes a workstation running a web server.","m.mentions":{},"msgtype":"m.text"},"ts":1729204663529,"senderName":"jamescobban","senderId":"@jamescobban:matrix.org","id":"$HsxnAM298hXZHSMzbLwFoOdJhp9g-goBQ6N6HpwvPAw"},
{"content":{"body":"I'm a little confused trying to implement the Update algorithm from the service workers spec. It seems like the spec hasn't been updated to reflect the latest changes to perform the fetch hook from the HTML spec? Specifically the concept of the processCustomFetchResponse algorithm","m.mentions":{},"msgtype":"m.text"},"ts":1729206965195,"senderName":"akaster","senderId":"@akaster:serenityos.org","id":"$DWsKiegpOFFrUUGR24cswnXSxQkStMnGy_dzX2C6EXU"},
{"content":{"body":"For example, steps 4, 5, and 6 say this:\n> 4. If the isTopLevel flag is unset, then return the result of fetching request.\n> 5. Set request’s redirect mode to \"error\".\n> 6. Fetch request, and asynchronously wait to run the remaining steps as part of fetch’s processResponse for the response response.\n","format":"org.matrix.custom.html","formatted_body":"<p>For example, steps 4, 5, and 6 say this:</p>\n<blockquote>\n<ol start=\"4\">\n<li>If the isTopLevel flag is unset, then return the result of fetching request.</li>\n<li>Set request’s redirect mode to \"error\".</li>\n<li>Fetch request, and asynchronously wait to run the remaining steps as part of fetch’s processResponse for the response response.</li>\n</ol>\n</blockquote>\n","m.mentions":{},"msgtype":"m.text"},"ts":1729206998669,"senderName":"akaster","senderId":"@akaster:serenityos.org","id":"$35gu0-dj-MDYxZ3JHA02Ry4zBKYljzaHH1eq6bJaS4U"},
{"content":{"body":"but in the steps for dedicated workers, https://html.spec.whatwg.org/multipage/workers.html#run-a-worker, it is quite a bit clearer...\n\n> 1. If isTopLevel is false, fetch request with processResponseConsumeBody set to processCustomFetchResponse, and abort these steps.\n> 2. Set request's reserved client to inside settings.\n> 3. Fetch request with processResponseConsumeBody set to the following steps given response response and null, failure, or a byte sequence bodyBytes:","format":"org.matrix.custom.html","formatted_body":"<p>but in the steps for dedicated workers, https://html.spec.whatwg.org/multipage/workers.html#run-a-worker, it is quite a bit clearer...</p>\n<blockquote>\n<ol>\n<li>If isTopLevel is false, fetch request with processResponseConsumeBody set to processCustomFetchResponse, and abort these steps.</li>\n<li>Set request's reserved client to inside settings.</li>\n<li>Fetch request with processResponseConsumeBody set to the following steps given response response and null, failure, or a byte sequence bodyBytes:</li>\n</ol>\n</blockquote>\n","m.mentions":{},"msgtype":"m.text"},"ts":1729207080487,"senderName":"akaster","senderId":"@akaster:serenityos.org","id":"$vm59izhdLyyLVUzlMo8OcZ2DBAiWjfHcWO0h4edWuis"},
{"content":{"body":"Should I just be assuming that steps 4,5,and 6 from service workers Update AO are written with the same language as run a worker and open a spec issue?","m.mentions":{},"msgtype":"m.text"},"ts":1729207130620,"senderName":"akaster","senderId":"@akaster:serenityos.org","id":"$byqdgqfg8uw0SAXBMpBPPI1NeSnL1cl88DaWtLoyoaw"}
]