[
{"content":{"body":"annevk: After looking some at https://github.com/mdn/content/pull/40085 I realized that the MDN docs (and the spec) seem to completely lacking any high-level explanation or use-cases description for web developers of what they’d want to use the Encodings API for in the JavaScript code for a web application (especially not `TextEncoder`).","format":"org.matrix.custom.html","formatted_body":"<a href=\"https://matrix.to/#/@annevk:matrix.org\">annevk</a>: After looking some at https://github.com/mdn/content/pull/40085 I realized that the MDN docs (and the spec) seem to completely lacking any high-level explanation or use-cases description for web developers of what they’d want to use the Encodings API for in the JavaScript code for a web application (especially not <code>TextEncoder</code>).","m.mentions":{"user_ids":["@annevk:matrix.org"]},"msgtype":"m.text"},"ts":1751012562370,"senderName":"sideshowbarker","senderId":"@sideshowbarker:matrix.org","id":"$qc_q5ZzDmwmofhnnMOkwoWw76HRFjXzp2cj9yIqflIU"},
{"content":{"body":"And I realized I personally don’t have any idea at what developers would want/need to use it for, and what motivated adding that JS API to the Encodings spec to begin with.","m.mentions":{},"msgtype":"m.text"},"ts":1751012578758,"senderName":"sideshowbarker","senderId":"@sideshowbarker:matrix.org","id":"$JNGRssagNS4zcudJdkaXZ63sqUmfVqB7dvYFaCcAXBo"},
{"content":{"body":"\nI’m not questioning whether there *are* plenty of good use cases for all the parts of that API. I assume there must be. But I’m just saying that I don’t know what those use cases might be — and I don’t know how to _find out_ what they might be, since the MDN docs and the spec seem to be lacking any details at at all about any use cases.","format":"org.matrix.custom.html","formatted_body":"I’m not questioning whether there <em>are</em> plenty of good use cases for all the parts of that API. I assume there must be. But I’m just saying that I don’t know what those use cases might be —&nbsp;and I don’t know how to <em>find out</em> what they might be, since the MDN docs and the spec seem to be lacking any details at at all about any use cases.","m.mentions":{},"msgtype":"m.text"},"ts":1751012635176,"senderName":"sideshowbarker","senderId":"@sideshowbarker:matrix.org","id":"$nxPv0buSVkg_gBZIEkELThiO28WaUTDzTfcQytWVa3c"}
]