[
{"content":{"body":"Regarding the conversation following https://github.com/whatwg/html/pull/11933#issuecomment-3576322026, is there an expectation on me as the PR author to file new PRs for the Fetch and CSP specifications to add `\"text\"` (or something like it) as a known fetch destination, along with its associated CSP directive? And is this something that ought to happen before or after the HTML spec PR gets merged?","format":"org.matrix.custom.html","formatted_body":"Regarding the conversation following https://github.com/whatwg/html/pull/11933#issuecomment-3576322026, is there an expectation on me as the PR author to file new PRs for the Fetch and CSP specifications to add <code>\"text\"</code> (or something like it) as a known fetch destination, along with its associated CSP directive? And is this something that ought to happen before or after the HTML spec PR gets merged?","m.mentions":{},"msgtype":"m.text"},"ts":1764133069952,"senderName":"eemeli","senderId":"@eemeli:mozilla.org","id":"$8aKIttbDe8Au0MoXGWyZolIIjJZPNZLMkdseA8_kyec"},
{"content":{"body":"eemeli: it's not necessarily on you, but you doing it might be most expedient. And usually we try to merge them all around the same time as they form a cohesive whole.","format":"org.matrix.custom.html","formatted_body":"<a href=\"https://matrix.to/#/@eemeli:mozilla.org\">eemeli</a>: it's not necessarily on you, but you doing it might be most expedient. And usually we try to merge them all around the same time as they form a cohesive whole.","m.mentions":{"user_ids":["@eemeli:mozilla.org"]},"msgtype":"m.text"},"ts":1764144503533,"senderName":"annevk","senderId":"@annevk:matrix.org","id":"$0JjuxumoLTJutFID7LokI8CaoQW-qWB3rQQEoNYU_KA"},
{"content":{"body":"That makes sense. Next (related) question: What's the appropriate place to discuss what the fetch destination and CSP directive ought to be, as I presume that ought to take into account the `type: 'bytes'` proposal as well, given how similar they are?","format":"org.matrix.custom.html","formatted_body":"That makes sense. Next (related) question: What's the appropriate place to discuss what the fetch destination and CSP directive ought to be, as I presume that ought to take into account the <code>type: 'bytes'</code> proposal as well, given how similar they are?","m.mentions":{},"msgtype":"m.text"},"ts":1764144733448,"senderName":"eemeli","senderId":"@eemeli:mozilla.org","id":"$liRvNoMef8n4fhkeROZ6uz6qexrpznjUlbCxv7gqKgw"}
]