[
{"content":{"body":"hello 👋 and thanks for having an interest in zalari; @ljharb @akirose where you able to get answers? sry for replying so late but i haven't used irc in years and forgot that the history isn't saved automatically.","msgtype":"m.text"},"ts":1619772793000,"senderName":"tkopp","senderId":"tkopp@irc"},
{"content":{"body":"tkopp: kind of not really :-)","msgtype":"m.text"},"ts":1619796140000,"senderName":"ljharb","senderId":"ljharb@irc"},
{"content":{"body":"tkopp: christian pointed at the custom elements loader thing, but i'm hoping to understand what you do in the context of a motivation for joining tc39","msgtype":"m.text"},"ts":1619796181000,"senderName":"ljharb","senderId":"ljharb@irc"},
{"content":{"body":"well, for the motivation. As a company we use JS/TS and its many frameworks on a daily basis and actually advocate the use of standards and modern JS throughout our work with our clients and the wider(local) developer community. As you already know we also host the local monthly JS meetup (for the 6. year now) and talk about the language. So, we follow the standard, work with it, help to spread it and gather","msgtype":"m.text"},"ts":1619810384000,"senderName":"tkopp","senderId":"tkopp@irc"},
{"content":{"body":"feedback from our community. As individuals we already track the work and changes of the standard and want to combine our involvement. The next logical step for us was to actually help develop the language. We also want to aggregate feedback and be a voice for likeminded developers, agencies and software companies. So, what better way to give to the community than to take part in this? :)","msgtype":"m.text"},"ts":1619810384000,"senderName":"tkopp","senderId":"tkopp@irc"},
{"content":{"body":"And we don't have anything to do with hydrogen bombs - that't just a clickbaity title 😅","msgtype":"m.text"},"ts":1619810656000,"senderName":"tkopp","senderId":"tkopp@irc"},
{"content":{"body":"tkopp: awesome! increased and more diverse community involvement is always great.","msgtype":"m.text"},"ts":1619810868000,"senderName":"ryzokuken","senderId":"ryzokuken@irc"},
{"content":{"body":"thanks, thats something i like to hear ˆˆ","msgtype":"m.text"},"ts":1619811076000,"senderName":"tkopp","senderId":"tkopp@irc"},
{"content":{"body":"tkopp: thanks! totes legit and there's no gatekeeping here around motivation, i was just curious since it wasn't immediately apparent to me","msgtype":"m.text"},"ts":1619811459000,"senderName":"ljharb","senderId":"ljharb@irc"},
{"content":{"body":"hu? never thought about gatekeeping ^^ the whole getting-started-process was already more involving and hands-on than I expected 👍","msgtype":"m.text"},"ts":1619811937000,"senderName":"tkopp","senderId":"tkopp@irc"},
{"content":{"body":"awesome","msgtype":"m.text"},"ts":1619821184000,"senderName":"ljharb","senderId":"ljharb@irc"}
]