[
{"content":{"body":"The more I look at the discussion around pipeline operator, the more it hurts. Now I feel like the bruteforcing / stealthing it through might be the only feasible way.","msgtype":"m.text"},"ts":1618026014000,"senderName":"Pokute","senderId":"Pokute@irc"},
{"content":{"body":"Not really through the TC39, but it fels like all new participants in the discussion are way too attached to one method.","msgtype":"m.text"},"ts":1618026290000,"senderName":"Pokute","senderId":"Pokute@irc"},
{"content":{"body":"It's like a war between two kinds of people, half of which want their peanut butter & jam sandwitchies to be PB on top, jam on bottom and other half jelly on top, PB on bottom. No-one really appreciates that turning the sandwitch over is so much easier than the status quo of having bread, PB and jam served in separate locations.","msgtype":"m.text"},"ts":1618026410000,"senderName":"Pokute","senderId":"Pokute@irc"},
{"content":{"body":"👀","msgtype":"m.text"},"ts":1618026701000,"senderName":"jackworks","senderId":"jackworks@irc"},
{"content":{"body":"should things like: new.target be treated as three tokens where we can put whitespace between? like new      .     target? https://tc39.es/ecma262/#prod-NewTarget to me it's not clear from the production if that is the case, or if it's just the sequence of code points: \"new.target\"","msgtype":"m.text"},"ts":1618045896000,"senderName":"aradesh","senderId":"aradesh@irc"},
{"content":{"body":"i suppose the lexical rules would already have identified it as like identifier, punctuator and identifier though so... i guess when you're applying the grammar, they'd already be three tokens","msgtype":"m.text"},"ts":1618046199000,"senderName":"aradesh","senderId":"aradesh@irc"},
{"content":{"body":"i guess i should be using the lexical parser to pass tokens to the grammar productions.. or getting my grammar productions to consume tokens via the lexical goals before checking the grammar","msgtype":"m.text"},"ts":1618049463000,"senderName":"aradesh","senderId":"aradesh@irc"},
{"content":{"body":"aradesh: in the NewTarget production, the single colon tells you that it's in the syntactic grammar, so yes it's 3 tokens with optional whitespace in-between. The lexical grammar cannot generate/recognize `new.target` as a single token.","msgtype":"m.text"},"ts":1618058055000,"senderName":"jmdyck","senderId":"jmdyck@irc"},
{"content":{"body":"See https://github.com/tc39/test262/blob/main/test/language/expressions/new.target/asi.js which tests various kinds of separation between the 3 tokens.","msgtype":"m.text"},"ts":1618058326000,"senderName":"jmdyck","senderId":"jmdyck@irc"}
]