[
{"content":{"body":"Maybe so.\n\nI don't envy the work done by delegates. But I am a little jealous of the trip to Japan. It sounds like a lot of fun and I think I saw something about karaoke the other day..","m.mentions":{"user_ids":["@devsnek:matrix.org"]},"m.relates_to":{"m.in_reply_to":{"event_id":"$dhi7CXh5sl1RpDrOHBO54bj94OrV2KYxAfTXQ5DLoO8"}},"msgtype":"m.text"},"ts":1763428001545,"senderName":"whosy","senderId":"@whosy:matrix.org","id":"$KwfjFLIxJE2m2793MRcoxk27-Axz_LN7UolUeUI9-Pc"},
{"content":{"body":"When less busy I should seek guidance again regarding my proposal.","m.mentions":{},"msgtype":"m.text"},"ts":1763428023065,"senderName":"whosy","senderId":"@whosy:matrix.org","id":"$YP6PzCF1guWj75zpg7KranxHRo9MeiDpO6cdqI6IQXk"},
{"content":{"body":"Question regarding Atomics wait/waitAsync and notify: are these intended to be just fronts for a futex API, possibly backed by the OS, or is the WL locking supposed to give some guarantees on top?\n\nThere's an atomic read inside the critical section of DoWait that makes sense to me if it is intended to model the OS futex APIs possibly never suspending a thread if the futexword comparison with value fails immediately. But is that the intention, or am I completely lost?","msgtype":"m.text"},"ts":1763469319254,"senderName":"Aapo Alasuutari","senderId":"@aapo.alasuutari:matrix.org","id":"$Aj6zChVOlUMffrdRB8s03N0_9szydlVcoje5H7TnpTI"},
{"content":{"body":"In effect what I guess I am asking is: is the critical section supposed to protect the buffer value / reading somehow as well? Looking at normal futex APIs it seems reasonable to implement the APIs using a native futex with the exception of the \"fail-fast\" path for waitAsync: using just futexes, the fail-fast read has to either be a separate atomic load before calling into a futex syscall, in which case it isn't done within the futex's critical section of course, or the main thread needs to spawn a separate thread for calling the syscall and then that thread needs to ... No, I guess it's just not really possible at all.","msgtype":"m.text"},"ts":1763476856970,"senderName":"Aapo Alasuutari","senderId":"@aapo.alasuutari:matrix.org","id":"$-byxsrnay-YNZqQzYqNaICnwbL1mfvkpp8p1JxTh4kU"},
{"content":{"body":"Nevermind: it's possible with a parking lot futex but as far as I can tell, the futex still needs to be locked on a separate thread and the main thread would need to block until the futex thread confirms that it is going to sleep. That hardly seems like a \"fail-fast\" path.","msgtype":"m.text"},"ts":1763476956101,"senderName":"Aapo Alasuutari","senderId":"@aapo.alasuutari:matrix.org","id":"$7LUZPeuzcCl8q9BRqsC20IJSV81oRqqPjVfdPm7Jv1o"}
]