[
{"content":{"body":"RE:incidental, I just meant that the syntax production names seem primarily in service of the hypothetical target EBNF-like target description, in other words, implementation details. Rather than say, something meant to be treated as a \"public facing\" AST-like node name.  As a quick example, \"TemplateSpan\" doesn't seem to represent any true conceptual idea, but simply a \"temp variable\" that needs to be named so that it can referenced and hold on to \"middles and tails but not head\" -- the idea of a \"template span\" isn't discussed in any meaningful way, and I wouldn't from this document say that this is some terminology I \"trust\" or anything. In large part, I don't thin the syntax production names make any sort of \"backwards compatibility\" guarantee, and have changed in the past (Formals became FormalParametersList, etc.) As such, since NoSubstitutionTemplate like TemplateSpan only shows up in that context, I simply wanted to check if it was something that perhaps is a term that gets used when discussin/documenting/etc. and thus I would make a point of trying to be consistent with that terminology in the stuff I write vs. if there not really any strong standard I may consider something else if I feel that it might make more sense to the audience","m.mentions":{},"msgtype":"m.text"},"ts":1738286390988,"senderName":"Francisco Tolmasky","senderId":"@tolmasky:matrix.org","id":"$Iw3fSQb8yF-vpuUu1dhweTFns6Xr2Asrlof_0t6BWNw"},
{"content":{"body":"there's not really a strong convention and you should use whatever term you think communicates best to your target audience","msgtype":"m.text"},"ts":1738286495338,"senderName":"Michael Ficarra","senderId":"@michaelficarra:matrix.org","id":"$6CFztl1_vpIkESKmw60tJfcCNzp4LnnzYjoA90jxNr0"},
{"content":{"body":"(also i don't think no-substitution backticks are common - most styleguides/eslint configs ban them and force you to either interpolate, or use single or double quotes)","m.mentions":{},"msgtype":"m.text"},"ts":1738296983833,"senderName":"ljharb","senderId":"@ljharb:matrix.org","id":"$N9G-IL9Lyfz5oIrgHo7o22oJLmub4AB_FYSKsXt6IDw"}
]