[
{"content":{"body":"Updated the calendar invite’s doc to that one","msgtype":"m.text"},"ts":1715053935250,"senderName":"Justin Ridgewell","senderId":"@jridgewell:matrix.org","id":"$VYgNW-MzcagGGQ3t81wSLy5nbvNUz6pRuGcsuaJgtmE"},
{"content":{"body":"@softwarechris:matrix.org Can you give me moderator access to the invite’s meet? That way we can publicize the link and still have it be invite-only (people can just ask to join during the meeting if they’re not on the invite yet)","format":"org.matrix.custom.html","formatted_body":"<a href=\"https://matrix.to/#/%40softwarechris%3Amatrix.org\">@Chris de Almeida</a> Can you give me moderator access to the invite’s meet? That way we can publicize the link and still have it be invite-only (people can just ask to join during the meeting if they’re not on the invite yet)","msgtype":"m.text"},"ts":1715054007125,"senderName":"Justin Ridgewell","senderId":"@jridgewell:matrix.org","id":"$MXT_7Op-z-BND-P_PECbgmiSeCw_4bH30ivnsqwMfPo"},
{"content":{"body":"you already have calendar permission and are the organizer of the meeting.  the web/video call settings are currently set to open access.  keep in mind if you change it from `Open` to `Trusted`, even if people are on the invite, they can only join automatically if their email on the invite is associated with a google account.  otherwise, they still need to be let in.  and the only person that can let anyone in is you","format":"org.matrix.custom.html","formatted_body":"you already have calendar permission and are the organizer of the meeting.  the web/video call settings are currently set to open access.  keep in mind if you change it from <code>Open</code> to <code>Trusted</code>, even if people are on the invite, they can only join automatically if their email on the invite is associated with a google account.  otherwise, they still need to be let in.  and the only person that can let anyone in is you","m.mentions":{},"msgtype":"m.text"},"ts":1715056271805,"senderName":"Chris de Almeida","senderId":"@softwarechris:matrix.org","id":"$8NXtieWuP-iUWvLZ_x-bxejaza8jl9ulDhifeH3ty9I"},
{"content":{"body":"I recall that being a problem, and the reason why the web meeting settings were changed to `Open`","format":"org.matrix.custom.html","formatted_body":"I recall that being a problem, and the reason why the web meeting settings were changed to <code>Open</code>","m.mentions":{},"msgtype":"m.text"},"ts":1715056332605,"senderName":"Chris de Almeida","senderId":"@softwarechris:matrix.org","id":"$BZ15iGQX1ir_3yFqCIOqFr17ZNHli1JxDh-m_I0mpMo"},
{"content":{"body":"Can only one person have that power?","msgtype":"m.text"},"ts":1715056365607,"senderName":"Justin Ridgewell","senderId":"@jridgewell:matrix.org","id":"$GQVA4mEDyj3jJWjUUEQk2B8smb_OlxTSSxgqi7hLzvY"}
]