[
{"content":{"body":"Yes, I think we should specify that, at the top level of the module, it's always a host-provided context (not necessarily empty--the host can put things there) and *not* based on what dynamic import triggered it (which would be racy)","format":"org.matrix.custom.html","formatted_body":"Yes, I think we should specify that, at the top level of the module, it's always a host-provided context (not necessarily empty--the host can put things there) and <em>not</em> based on what dynamic import triggered it (which would be racy)","m.mentions":{},"msgtype":"m.text"},"ts":1718880898406,"senderName":"littledan","senderId":"@littledan:matrix.org","id":"$1QxxlQ8uzX5s5T-XzWgCarUFnkyZrVUGtXCunzzdVtk"},
{"content":{"body":"in some super high level way, this is 'registration time' rather than 'call time' (it's the context of the module registry, not the dynamic import)","m.mentions":{},"msgtype":"m.text"},"ts":1718880948054,"senderName":"littledan","senderId":"@littledan:matrix.org","id":"$9QjFE7DMmFymO7rRKuhA03wWf799sR75Dsb1CfpWQPQ"},
{"content":{"body":"The empty use case is definitely hypothetical - I see it as a possible counterexample to Daniel's axiom that we should never use the root/empty context if there's any possible non-empty one available.\n\nThe race condition for dynamic imports is interesting, and I think it speaks to a more general principle that registration context just generally tends to be less racy than causal context.  That said, despite the raciness, I think it's still important to be able to _access_ the causal context on-demand, even if it's not the context that's exposed by default.","format":"org.matrix.custom.html","formatted_body":"<p>The empty use case is definitely hypothetical - I see it as a possible counterexample to Daniel's axiom that we should never use the root/empty context if there's any possible non-empty one available.</p>\n<p>The race condition for dynamic imports is interesting, and I think it speaks to a more general principle that registration context just generally tends to be less racy than causal context.  That said, despite the raciness, I think it's still important to be able to <em>access</em> the causal context on-demand, even if it's not the context that's exposed by default.</p>\n","m.mentions":{},"msgtype":"m.text"},"ts":1718903912619,"senderName":"Steve Hicks","senderId":"@stephenhicks:matrix.org","id":"$wYjWpjypbgqzIDBVR1b2XJf7diaZTfPTS-Y3AVe4OKY"},
{"content":{"body":"I assume that would maybe apply to module loading just as well as anything else?  If we're going with the approach of adding a causal context property to the event object, would that translate to adding a property to import.meta?","m.mentions":{},"msgtype":"m.text"},"ts":1718903972037,"senderName":"Steve Hicks","senderId":"@stephenhicks:matrix.org","id":"$Q6Q0k__UpHf2g0EAw8UzG8LnekOH_m1WIpBWkvgQHzY"}
]