[
{"content":{"body":"RGN just mentioned the idea that \"all async iterator cleanup solutions are isomorphic to each other\" e.g. resolving a promise when it's done - but this reminds me of a discussion I brought up earlier about using promises to simulate events - when async context is involved, the isomorphism potentially breaks down if you want the cleanup to happen in the same context as the job itself...","m.mentions":{},"msgtype":"m.text"},"ts":1763515793539,"senderName":"Steve Hicks","senderId":"@stephenhicks:matrix.org","id":"$B4wcp1GaAwgEEt0o2plz9_g4HTR6iIys7YaeuMBAH8I"},
{"content":{"body":"The simulation of events with promise is not an exact simulation though, particularly about the execution time of the handlers. Promises forces deferral of the handler execution time. Another common pitfalls is that `event.preventDefault()` does not work after `await`","format":"org.matrix.custom.html","formatted_body":"The simulation of events with promise is not an exact simulation though, particularly about the execution time of the handlers. Promises forces deferral of the handler execution time. Another common pitfalls is that <code>event.preventDefault()</code> does not work after <code>await</code>","m.mentions":{},"msgtype":"m.text"},"ts":1763516374967,"senderName":"Chengzhong Wu","senderId":"@legendecas:matrix.org","id":"$nA_vycxCmbjTtEb22qGXuWDms-dq3hR99OuJraUElzY"},
{"content":{"body":"* The simulation of events with promise is not an exact simulation though, particularly about the execution time of the handlers. Promises forces deferral of the handler execution time. Another common pitfall is that `event.preventDefault()` does not work after `await`","format":"org.matrix.custom.html","formatted_body":"* The simulation of events with promise is not an exact simulation though, particularly about the execution time of the handlers. Promises forces deferral of the handler execution time. Another common pitfall is that <code>event.preventDefault()</code> does not work after <code>await</code>","m.mentions":{},"m.new_content":{"body":"The simulation of events with promise is not an exact simulation though, particularly about the execution time of the handlers. Promises forces deferral of the handler execution time. Another common pitfall is that `event.preventDefault()` does not work after `await`","format":"org.matrix.custom.html","formatted_body":"The simulation of events with promise is not an exact simulation though, particularly about the execution time of the handlers. Promises forces deferral of the handler execution time. Another common pitfall is that <code>event.preventDefault()</code> does not work after <code>await</code>","m.mentions":{},"msgtype":"m.text"},"m.relates_to":{"event_id":"$nA_vycxCmbjTtEb22qGXuWDms-dq3hR99OuJraUElzY","rel_type":"m.replace"},"msgtype":"m.text"},"ts":1763516381041,"senderName":"Chengzhong Wu","senderId":"@legendecas:matrix.org","id":"$5H99lRFu_4DCPPP8sGmfAownxi4b_1yesI_3ufBpduc"},
{"content":{"body":"sorry, I don't mean general-purpose event simulation - but exposing event-like things using promises _instead of_ events because it's a nicer API to code against.  But the mismatch as I see it is that \"event-like\" things want dispatch context and promises hide that context.  Same situation potentially with these async iteration cleanups - choosing to expose it via a promise may be \"isomorphic\" in some senses, but with AsyncContext in the mix, it has very real differences.","format":"org.matrix.custom.html","formatted_body":"sorry, I don't mean general-purpose event simulation - but exposing event-like things using promises <em>instead of</em> events because it's a nicer API to code against.  But the mismatch as I see it is that \"event-like\" things want dispatch context and promises hide that context.  Same situation potentially with these async iteration cleanups - choosing to expose it via a promise may be \"isomorphic\" in some senses, but with AsyncContext in the mix, it has very real differences.","m.mentions":{},"msgtype":"m.text"},"ts":1763523320358,"senderName":"Steve Hicks","senderId":"@stephenhicks:matrix.org","id":"$KXweUwPxEs53Z_nG6uEz9OZyErXGJxZLJaSB-uLRR1o"}
]