[
{"content":{"body":"Hey folks! We're trying to plan our next in-person gettogether and hackathon. I was thinking Munich hosted in the Google office would be good considering how many of our members live in that area. We also thought picking a date that's far enough from today that we'll have some great progress to share but not too far from the TC39 September plenary so we can make sure we're on a good track for that presentation. I'm going to throw out a few dates to vote on and if the location or the dates are problematic, please let me know and we'll try to work it out!\n\n","m.mentions":{},"msgtype":"m.text"},"ts":1707748432134,"senderName":"jkup","senderId":"@jkup:matrix.org","id":"$5XGLx3rvLxO1HwmKToIcEbnkYW3EG4elPgA2J-x7oO0"},
{"content":{"body":" * Hey folks! We're trying to plan our next in-person get together and hackathon. We were thinking Munich again, hosted in the Google office considering how many of our members live in that area. We also thought picking a date that's far enough from today that we'll have some great progress to share but not too far from the TC39 September plenary so we can make sure we're on a good track for that presentation. I'm going to throw out a few dates to vote on and if the location or the dates are problematic, please let me know and we'll try to work it out!\n\n","m.mentions":{},"m.new_content":{"body":"Hey folks! We're trying to plan our next in-person get together and hackathon. We were thinking Munich again, hosted in the Google office considering how many of our members live in that area. We also thought picking a date that's far enough from today that we'll have some great progress to share but not too far from the TC39 September plenary so we can make sure we're on a good track for that presentation. I'm going to throw out a few dates to vote on and if the location or the dates are problematic, please let me know and we'll try to work it out!\n\n","m.mentions":{},"msgtype":"m.text"},"m.relates_to":{"event_id":"$5XGLx3rvLxO1HwmKToIcEbnkYW3EG4elPgA2J-x7oO0","rel_type":"m.replace"},"msgtype":"m.text"},"ts":1707748486643,"senderName":"jkup","senderId":"@jkup:matrix.org","id":"$E6-UFtPpChYTneBw25GV19PsIsCuZTlElcbsZHFjv3A"}
]