[
{"content":{"body":"I'm in the process of writing a simple test for the \"Debug ID\" proposal. The question is what to do for index source maps in general for \"debug IDs\". Thinking about it for a minute, I think the correct thing to do would be to add a \"debugId\" field also to the root of an index source map, and the decoding ignores \"debugIds\" of the section source maps. This way, the sections can have different \"debugId\"s that match with their section `\"file\"`. While the \"root debugId\" of an index source map matches with the \"root file\" field. Thoughts?","format":"org.matrix.custom.html","formatted_body":"I'm in the process of writing a simple test for the \"Debug ID\" proposal. The question is what to do for index source maps in general for \"debug IDs\". Thinking about it for a minute, I think the correct thing to do would be to add a \"debugId\" field also to the root of an index source map, and the decoding ignores \"debugIds\" of the section source maps. This way, the sections can have different \"debugId\"s that match with their section <code>\"file\"</code>. While the \"root debugId\" of an index source map matches with the \"root file\" field. Thoughts?","m.mentions":{},"msgtype":"m.text"},"ts":1756975716322,"senderName":"Simon Zünd","senderId":"@szuend:matrix.org","id":"$T_hCNycV-Nj2nHKTCIjBJAjrNO6jpekQS122O3Aj0wA"},
{"content":{"body":"Actually, this would pretty much match what we do with the `\"file\"` field: The \"root file\" field is the one used for the source map record. And section `\"file\"` fields are ignored.","format":"org.matrix.custom.html","formatted_body":"Actually, this would pretty much match what we do with the <code>\"file\"</code> field: The \"root file\" field is the one used for the source map record. And section <code>\"file\"</code> fields are ignored.","m.mentions":{},"msgtype":"m.text"},"ts":1756976760496,"senderName":"Simon Zünd","senderId":"@szuend:matrix.org","id":"$bQ5Bcxdo7N0ZNpDr7L7h5sP9lzh8AqYmUrgsmKsGYvQ"},
{"content":{"body":"I put up a PR for the tests, might be easier to discuss with concrete examples: https://github.com/tc39/source-map-tests/pull/36","m.mentions":{},"msgtype":"m.text"},"ts":1756977819890,"senderName":"Simon Zünd","senderId":"@szuend:matrix.org","id":"$ER5qoXCDU9kurqacFJqE2FNwfo0WV7EqOLZxj2P24Dg"}
]