[
{"content":{"body":"Regarding the intermediate design family for transferrable modules, I am warming up to the intermediate position, where a ModuleSource may share private state with the host module loader, not just for CSP, but to determine import hook behavior. I have been mulling the implications for host virtualization and so far conclude that the behavior is trivial to emulate with a side table or private field. For a module loader that is serving as both a host and guest, the module-in-the-middle is sufficiently empowered that it can implement its own emulation of CSP or deny the host behavior. In short, I’m running out of reasons to dislike this framing and I’ll bring this up at the SES meeting today to socialize it.","m.mentions":{},"msgtype":"m.text"},"ts":1698853556206,"senderName":"Kris Kowal","senderId":"@kriskowal:matrix.org","id":"$fpsdtQdfN6IbKPeo-2MdcgTq_YNg1MqnmGp9iqVa2-M"},
{"content":{"body":"It’s attractive that neither CSP nor import.meta.url need to be captured on the 262 side and can exist entirely in the HTML integration.","m.mentions":{},"msgtype":"m.text"},"ts":1698853875999,"senderName":"Kris Kowal","senderId":"@kriskowal:matrix.org","id":"$kiVyheKMvRzZ4dx_COpRa5h2my7HLMP--yXiixggEiQ"},
{"content":{"body":"Interesting, I wonder how that interacts with multi-instantiation of modules ","msgtype":"m.text"},"ts":1698854007556,"senderName":"nicolo-ribaudo","senderId":"@nicolo-ribaudo:matrix.org","id":"$vdDblGE_VQpFqE49LVBmsYqy0N8c-sbD8fiE-WFiSkk"},
{"content":{"body":"I don't think I can join the SES meeting (this is the \"half of the meetings switched timezone, the other half didn't\" week), but I'll watch the recording ","msgtype":"m.text"},"ts":1698854022924,"senderName":"nicolo-ribaudo","senderId":"@nicolo-ribaudo:matrix.org","id":"$lmDIdLloJnIYYq_UTw-muahDAnKdeOKpbX09qIbmDhI"},
{"content":{"body":"Re multi-instantiation, I’m assuming the host module loader shares a module map keyed on url among all the instances it creates, so the host import hook is in a position to inspect the privately held url on the source and decide to reuse another instance.","m.mentions":{},"msgtype":"m.text"},"ts":1698854145068,"senderName":"Kris Kowal","senderId":"@kriskowal:matrix.org","id":"$4G2h21y-clJr4HOB9N0ulVu5nrtYHVWr9m0TSeYzYqc"},
{"content":{"body":"That implies a return override, gross.","m.mentions":{},"msgtype":"m.text"},"ts":1698854190391,"senderName":"Kris Kowal","senderId":"@kriskowal:matrix.org","id":"$bslm20Y8qyKdgNwVEk6PmjwoPPlHwvABotQ4_TnEbew"},
{"content":{"body":"Might also imply that we need to thread return override down to the initializer hook, should we choose to pursue the revealing callback.","m.mentions":{},"msgtype":"m.text"},"ts":1698854326883,"senderName":"Kris Kowal","senderId":"@kriskowal:matrix.org","id":"$J4JhaGlIQsBPkenFm_beLILCxbl4j0U4V4u5NabOdaA"}
]