[
{"content":{"body":"Food for thought for folks in this room. For ModuleSource instances, XS reflected bindings with a `bindings` array and the mood in the room currently favors `import()`, `exports()`, and `reexports()` methods that return arrays of import specifiers, names, and import specifiers respectively. A virtual module source would be obliged to provide one or the other, but the XS `bindings` reflects a detail that is probably important. The evaluation of a virtual module source needs to get a namespace object that reflects the _internal_ names for all the bindings, like `import {x as y} from 'z'` would have `y` on the external namespace, and the `x` property on the internal namespace. This allows for `import {x as y} from 'a'; import {x as z} from 'b'`. This is a detail that the `imports()`, `exports()`, and `reexports()` expression of bindings can’t express.","format":"org.matrix.custom.html","formatted_body":"Food for thought for folks in this room. For ModuleSource instances, XS reflected bindings with a <code>bindings</code> array and the mood in the room currently favors <code>import()</code>, <code>exports()</code>, and <code>reexports()</code> methods that return arrays of import specifiers, names, and import specifiers respectively. A virtual module source would be obliged to provide one or the other, but the XS <code>bindings</code> reflects a detail that is probably important. The evaluation of a virtual module source needs to get a namespace object that reflects the <em>internal</em> names for all the bindings, like <code>import {x as y} from 'z'</code> would have <code>y</code> on the external namespace, and the <code>x</code> property on the internal namespace. This allows for <code>import {x as y} from 'a'; import {x as z} from 'b'</code>. This is a detail that the <code>imports()</code>, <code>exports()</code>, and <code>reexports()</code> expression of bindings can’t express.","m.mentions":{},"msgtype":"m.text"},"ts":1719875310735,"senderName":"kriskowal","senderId":"@kriskowal:aelf.land","id":"$lVVYoYnyd7i3LVpZ6JbDK-k-CZiX-ScJkqCP6TJxAtM"}
]