[
{"content":{"body":"Anyone around to merge #1058, #1059, #1060, #1061 in https://github.com/tc39/agendas/pulls?","msgtype":"m.text"},"ts":1634288234284,"senderName":"rbuckton","senderId":"@rbuckton:matrix.org","id":"$Xuk4T6Y98535HQc9_ePSfU9Y22Y35bmHSM-TCzjsHQ8"},
{"content":{"body":"If not, I think I can merge myself","msgtype":"m.text"},"ts":1634288342035,"senderName":"rbuckton","senderId":"@rbuckton:matrix.org","id":"$moOyZk_kXZZXqGhgodzDfj77Sh3JoBRxV5-fJ9XWxlU"},
{"content":{"body":"If we are still light on the agenda, there are a few more proposals I intend to split off from https://github.com/rbuckton/proposal-regexp-features into individual proposals that I can add as well. I intended to propose them for Stage 1, but did not have the time to make individual repos/slide decks for each feature prior to the agenda deadline. I am aware they could be rejected purely on this basis, but if we have the time to spare I can finishing breaking them down tomorrow and add them to the agenda.","msgtype":"m.text"},"ts":1634289711402,"senderName":"rbuckton","senderId":"@rbuckton:matrix.org","id":"$o4dVOFARBTBO0cleE_VSXOTDkTkzvUAOJzVJAAP8Hag"},
{"content":{"body":"They don’t need to be merged before the deadline, for future reference; merely opening the PR is sufficient.","msgtype":"m.text"},"ts":1634312635534,"senderName":"ljharb","senderId":"@ljharb:matrix.org","id":"$5uW8pcprZs79yjQ2Bs5Ry4xwwhfLqbVQp8_hqacdEPg"},
{"content":{"body":"I pointed this out on GH as well, but the Agenda topic rules are actually unclear on that subject:","msgtype":"m.text"},"ts":1634327567437,"senderName":"rbuckton","senderId":"@rbuckton:matrix.org","id":"$5n-MttWGDnVyCVGOQGo94WB7om8wzA_LnQmPLdMFV1s"},
{"content":{"body":"The term \"pull request\" is only used in reference to (1). All other points use the term \"added\" which, given the distinction for PRs in (1), seems to indicate they must be part of the actual agenda by the deadline. If merely having the PR by the deadline is acceptable, I suggest we change the wording in the agenda topic rules.","msgtype":"m.text"},"ts":1634327657455,"senderName":"rbuckton","senderId":"@rbuckton:matrix.org","id":"$71s1lbP3w8IUOOiSb66ohQ-f4O0h9KwgX-q8A8U0sjY"},
{"content":{"body":"I'd be happy to clarify the rules to say that raising a PR (that includes the links to the materials) is sufficient. Review/merge time should not count against the submitter given that in all normal circumstances it will get merged within a day. ","msgtype":"m.text"},"ts":1634327749666,"senderName":"Rob Palmer","senderId":"@robpalme:matrix.org","id":"$ZvOnuwH-i07QPK6WZU1NudxM7-dCPATKIy6IK6PLJf4"},
{"content":{"body":"I was leaning towards the \"added\" meaning \"merged\" interpretation because there's no guarantee that a TC39 member looking at the agenda would be expected to also check the open PRs for other not-yet-merged topics and might miss a topic and be unwilling to advance as a result.","msgtype":"m.text"},"ts":1634327773919,"senderName":"rbuckton","senderId":"@rbuckton:matrix.org","id":"$cG4aB02PUhjg0GosuBhOgmXAis-DNEWtyapOry4qoak"},
{"content":{"body":"As someone who had a proposal blocked because I'd neglected to hit submit on the PR after publishing the branch for the PR (damn two-step process for proposing a change to a MD file on GitHub), I admit to being a bit more cautious in my interpretation. Yes, its not quite the same thing since branches are significantly less visible than PRs, but still its not something I'd like to repeat.","msgtype":"m.text"},"ts":1634328054376,"senderName":"rbuckton","senderId":"@rbuckton:matrix.org","id":"$uOmczEJpNgZ0xGb7k4_qhliNz1JKXHLwHhil_JAK4QU"}
]