[
{"content":{"body":"littledan etc: is there a types-as-comments chat room or call or something I could join? I have a followup thesis from the discussion earlier:\n\n- Making almost all of TS runnable is a bad goal.\n  - It's too big to reasonably specify.\n  - TS adds new keywords more frequently than our process would allow, and that's good. The constraints on evolving the grammar of TS are genuinely different from the constraints on evolving the grammar of JS.\n  - And given the existence of things like Svelte, JSX, `--experimentalDecorators`, etc, you're never going to reach a point where almost all TS projects can stop using transpilers anyway, so there's nothing particularly special about \"almost all of TS\".\n- Making it more practical to use type checkers without transpilation is a good goal. The current jsdoc support in TS is bad enough that people will put up with the cost of transpilation rather than use it except in extreme cases (e.g. Svelte), and that could be improved.\n  - But that only helps people in specific circumstances (i.e., those who otherwise would not have a transpilation step).\n  - Flow's comment syntax actually gets used, which means that there's room for something between \"only jsdoc-style comments\" and \"all of TS\".\n  - By far the largest painpoint with Flow's comment syntax is inline type annotations on variables and parameters. Multiline comment syntax is verbose and awkward to type for something used so frequently.\n- Therefore, the proposal ought to drop the \"un-fork JS\" goal and instead set a goal of 80-20'ing the types-without-transpilation experience using a more minimal grammar, omitting (e.g.) any keywords other than maybe `type`. There's a handful of issues on the repo already proposing something like this. Those users who would benefit can opt in without much more pain, and those who would not can continue to benefit from TypeScript's full syntax being able to evolve outside our process.\n  - This doesn't need to be a subset of the TS grammar, particularly if automated translation from full-TS to this subset is easy (which it ought to be).\n  - This should be general enough to allow ~any type system to opt in to using only this grammar, but shouldn't aim to have parity with the grammar of any existing type systems. It's OK if this grammar is somewhat more awkward than those available when using a transpiler.\n  - Concretely, this might look like `:: [nlth] (.? IdentifierName [nlth])* MatchedBraces` being allowed in a few places, and maybe a new top-level `type` declaration form. Possibly with one or two more forms for e.g. imports, but only a couple more at most.\n    - This solves some but not all of the ambiguities in the current grammar; the remaining ones (e.g. FunctionBody braces) would need fixing either way.\n    - Yes, this means a lot of nontrivial types will need parentheses. That is a significant cost. I think the cost is worth it.","format":"org.matrix.custom.html","formatted_body":"<p><a href=\"https://matrix.to/#/@littledan:matrix.org\">littledan</a> etc: is there a types-as-comments chat room or call or something I could join? I have a followup thesis from the discussion earlier:</p>\n<ul>\n<li>Making almost all of TS runnable is a bad goal.\n<ul>\n<li>It's too big to reasonably specify.</li>\n<li>TS adds new keywords more frequently than our process would allow, and that's good. The constraints on evolving the grammar of TS are genuinely different from the constraints on evolving the grammar of JS.</li>\n<li>And given the existence of things like Svelte, JSX, <code>--experimentalDecorators</code>, etc, you're never going to reach a point where almost all TS projects can stop using transpilers anyway, so there's nothing particularly special about \"almost all of TS\".</li>\n</ul>\n</li>\n<li>Making it more practical to use type checkers without transpilation is a good goal. The current jsdoc support in TS is bad enough that people will put up with the cost of transpilation rather than use it except in extreme cases (e.g. Svelte), and that could be improved.\n<ul>\n<li>But that only helps people in specific circumstances (i.e., those who otherwise would not have a transpilation step).</li>\n<li>Flow's comment syntax actually gets used, which means that there's room for something between \"only jsdoc-style comments\" and \"all of TS\".</li>\n<li>By far the largest painpoint with Flow's comment syntax is inline type annotations on variables and parameters. Multiline comment syntax is verbose and awkward to type for something used so frequently.</li>\n</ul>\n</li>\n<li>Therefore, the proposal ought to drop the \"un-fork JS\" goal and instead set a goal of 80-20'ing the types-without-transpilation experience using a more minimal grammar, omitting (e.g.) any keywords other than maybe <code>type</code>. There's a handful of issues on the repo already proposing something like this. Those users who would benefit can opt in without much more pain, and those who would not can continue to benefit from TypeScript's full syntax being able to evolve outside our process.\n<ul>\n<li>This doesn't need to be a subset of the TS grammar, particularly if automated translation from full-TS to this subset is easy (which it ought to be).</li>\n<li>This should be general enough to allow ~any type system to opt in to using only this grammar, but shouldn't aim to have parity with the grammar of any existing type systems. It's OK if this grammar is somewhat more awkward than those available when using a transpiler.</li>\n<li>Concretely, this might look like <code>:: [nlth] (.? IdentifierName [nlth])* MatchedBraces</code> being allowed in a few places, and maybe a new top-level <code>type</code> declaration form. Possibly with one or two more forms for e.g. imports, but only a couple more at most.\n<ul>\n<li>This solves some but not all of the ambiguities in the current grammar; the remaining ones (e.g. FunctionBody braces) would need fixing either way.</li>\n<li>Yes, this means a lot of nontrivial types will need parentheses. That is a significant cost. I think the cost is worth it.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n","m.mentions":{"user_ids":["@littledan:matrix.org"]},"msgtype":"m.text"},"ts":1696360919410,"senderName":"bakkot","senderId":"@bakkot:matrix.org","id":"$Ufp-5ap69ZPAMkgiN_ohLZESD3mG5i2hKkmXU5Baa80"},
{"content":{"body":"Yeah, there is a Matrix room, I will try to get it more open to TC39 in general (I don’t have permission to add you). Thanks for the thoughtful comment, interesting stuff to consider. May be good to file an issue for too.","msgtype":"m.text"},"ts":1696366484496,"senderName":"littledan","senderId":"@littledan:matrix.org","id":"$XTq7BTFdyq769bQCYe9o9EIWw3MQ-tX1eh9cPAR9TFo"}
]