[
{"content":{"body":"What's the right process to get consensus on it from TG1 in Helsinki for normative PRs to ECMA-402? Do I add it as a standalone agenda item?  As part of a standing agenda item for 402 changes?  Something else? PR is https://github.com/tc39/ecma402/pull/877\n\nThis is mostly a \"web reality\" change that aligns the spec with how V8 and JSC already behave by tightening under-specified parts of the spec. It also adds forward-looking guidance to handle future issues that may crop up with time zone identifiers.\n\nIdeally I would have asked this question yesterday before the deadline, but I mistakenly believed that all TG2-approved PRs would magically make it into the agenda. Oops. Anyway, I'll add this as a late submission. ","m.mentions":{},"msgtype":"m.text"},"ts":1717212577615,"senderName":"justingrant","senderId":"@justingrant:matrix.org","id":"$1S-M8IAWPMW5rHLhNWp_R6xhM8q1EU4iTmBidCW61I0"},
{"content":{"body":"I believe you still have two hours before the deadline","m.mentions":{},"msgtype":"m.text"},"ts":1717216405929,"senderName":"bakkot","senderId":"@bakkot:matrix.org","id":"$ZSOcOaYucoUbElvg6TNPQDyJC-gOEWGFDoNZps-y5FA"},
{"content":{"body":"this is a three-day meeting so the deadline is Saturday rather than Friday (but Saturday in Helsinki, so earlier than it would for meetings in PT)","m.mentions":{},"msgtype":"m.text"},"ts":1717216464705,"senderName":"bakkot","senderId":"@bakkot:matrix.org","id":"$Yz3ssn0yTTxxwurndRHeArQWEvcmHtLA4Mk1fSYmWJs"},
{"content":{"body":"Yeah, it should be added under \"Needs Consensus PRs\". ECMA-402 PRs previously got added automatically, but that practice stopped about a year ago. Now we just make an announcement in the monthly TG2 call to remind champions to add their stuff to the TG1 agenda if it needs TG1 consensus.","m.mentions":{},"msgtype":"m.text"},"ts":1717230817254,"senderName":"sffc","senderId":"@sffc:mozilla.org","id":"$rUpBal3AS7UsGzUgN9F6HW0A4ezRuAfb0eKLHp2fbAY"},
{"content":{"body":"We still have around 3 hours of spare capacity. So please don't let the agenda deadline stop you from adding more items. ","format":"org.matrix.custom.html","formatted_body":"We still have around 3 hours of spare capacity. So please don't let the agenda deadline stop you from adding more items.","msgtype":"m.text"},"ts":1717283463610,"senderName":"Rob Palmer","senderId":"@robpalme:matrix.org","id":"$MycgF9VSJfAcblT8xDxmE758fM4ITeURrRcJ8MNUjwo"}
]