[
{"content":{"body":"Hi there. I have two small questions: \n\nFirst one is regarding a need I had recently to get both quotient and remainder of an integer division at the same time.\n\nDidn't found anything doing it in JS, and felt a bit dumb needing to perform two distinct operations to do so.\n\nOk, it feels like micro optimization, and they are good chances that many JS engines optimize it transparently, but I just wanted to make sure I didn't missed anything about such a basic problematic 😛","msgtype":"m.text"},"ts":1664020787058,"senderName":"lemmy","senderId":"@mumeii:matrix.org","id":"$GpjLtrLYaWerRBjfP6ozGoPfnvVvqWx1WwphRJuxHjo"},
{"content":{"body":"My second question is regarding a (maybe bad) code pattern I'm using often, which looks like : \n\nlet options = {}\n...\noptions = { ... options, extraParam }\n...\noptions = { anotherExtraParam, ...options }\n...\n\n","msgtype":"m.text"},"ts":1664021138807,"senderName":"lemmy","senderId":"@mumeii:matrix.org","id":"$wnWf7RRyQmsOGBfld7e98fiaPgJMIZqD3yYSbYlTIK8"},
{"content":{"body":"This pattern is making me feel like I'm adding fields to an object as if one would do :\n\ncount += 5\n\nExcept that there is no affectation operator to do it.","msgtype":"m.text"},"ts":1664021265964,"senderName":"lemmy","senderId":"@mumeii:matrix.org","id":"$io7__n6gGLuPZst5RIeiJfbHM800nv3O2aZLCllNnKM"},
{"content":{"body":"Is there a better way to write it, that would avoid writing twice the 'options' variable in the first code example ?","msgtype":"m.text"},"ts":1664021326569,"senderName":"lemmy","senderId":"@mumeii:matrix.org","id":"$eSJUrD-MoVqMuaOPjfBJS3ybAeHScQa__pq8C4hG-9s"},
{"content":{"body":"And would creating two new affectation operator such as :\n\noptions ...= extraParam\n\noptions =... anotherExtraParam\n\nWould make any sense.\n\nI mean I'm not even talking about all the syntaxique problematic it could arise, but simply if it would be of any use, wouldn't promote bad development habits, and wouldn't simply write another way something that could already be written in a simpler way 🤔","msgtype":"m.text"},"ts":1664021568588,"senderName":"lemmy","senderId":"@mumeii:matrix.org","id":"$WG680yIHDyFN0jKhu5iumMUO1p-49cJM8Xe040HC6LI"}
]